# python3.6
# Create date: 2020-05-19
# Function: 19年11月最新-《TensorFlow+2.0深度学习算法实战教材》

import tensorflow as tf 
import math
import abc
import numpy as np

# ======== 目录 ==========
# &7 反向传播
#   - 7.8 Himmelblau函数优化实战


# ========================

# =======================================================================================================
#                                           第七章   反向传播
# =======================================================================================================
# 7.8 Himmelblau函数优化实战
# ---------------------------------------------------
## 7.8.1 单个神经元梯度
