# python3.6
# Create date: 2020-04-20
# Function: 19年11月最新-《TensorFlow+2.0深度学习算法实战教材》

import tensorflow as tf 
import math
import abc
import numpy as np

# ======== 目录 ==========
# &4 tf基础
#   - 4.7 维度变换

# ========================

# =======================================================================================================
#                                           第二章   TensorFlow基础
# =======================================================================================================

## 4.7 维度变换
#-----------------------------------------------
### 4.7.1 reshape
x = tf.range(96)
x = tf.reshape(x, [2, 4, 4, 3])
x
# 按初始视图为[b, h, w, c]
## [b,h*w, c] 张量理解为 b张图片， h*w个像素点，c个通道
## [b,h, w*c] 张量理解为 b张图片， h行，每行的特征长度为 w*c
## [b,h*w*c] 张量理解为 b张图片， 每张图片的特征长度为 h*w*c
x.ndim, x.shape


x = tf.reshape(x, [2, -1, 3])
# -1表示当前轴上程度需要根据视图总元素不变的发展自动推导
#即 
2 * 4* 4 *3/2/3
x.ndim, x.shape

### 4.7.2 增删维度
